d7.8/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
   //x y z
    (-160 -7.8 0)	//0              
    (-19.5 -7.8 0)//1
    (-18 -6.8 0)	//2
    ( -16.38 -6.8 0)//3
    (-15 -6.8 0)//4
    (-3 1.2 0)	//5
             
    (-1.5 1.2 0)//6
    (-1.5 2.58 0 )	//7	   
    (0 2.58 0 )//8
    (0 -2.8 0) //9	            
    (30 -2.8 0)	//10

    (-160 -6.8 0)	//11    
    (30 2.58 0)	//12
    (-160 26.2 0)//13
    (-18 26.2 0)//14
    (-16.38 26.2 0)//15
    (-3 26.2 0)//16
    (-1.5 26.2 0)//17
    (0 26.2 0)//18
    (30 26.2 0)//19
    (-3 2.58 0)//20 

     (-160 -7.8 1)	//0              
    (-19.5 -7.8 1)//1
    (-18 -6.8 1)	//2
    ( -16.38 -6.8 1)//3
    (-15 -6.8 1)//4
    (-3 1.2 1)	//5
             
    (-1.5 1.2 1)//6
    (-1.5 2.58 1 )	//7	   
    (0 2.58 1 )//8
    (0 -2.8 1) //9	            
    (30 -2.8 1)	//10

    (-160 -6.8 1)	//11    
    (30 2.58 1)	//12
    (-160 26.2 1)//13
    (-18 26.2 1)//14
    (-16.38 26.2 1)//15
    (-3 26.2 1)//16
    (-1.5 26.2 1)//17
    (0 26.2 1)//18
    (30 26.2 1)//19
    (-3 2.58 1)//20 
);		            

blocks
(
    hex (0 1 2 11 21 22 23 32) (352 5 1) simpleGrading (1 1 1)			//0	
    hex (11 2 14 13 32 23 35 34)  (352 165 1) simpleGrading (1 1 1)		//1
    hex (2 3 15 14 23 24 36 35) (4 165 1) simpleGrading (1 1 1)		        //2
    hex (3 20 16 15 24 41 37 36 ) (33 165 1) simpleGrading (1 1 1)		//3
    hex (20 7 17 16 41 28 38 37) (6 165 1 ) simpleGrading (1 1 1)//4
    hex (3 4 5 20 24 25 26 41) porosity (6 33 1) simpleGrading (1 1 1)//5
    hex (5 6 7 20 26 27 28 41) porosity (6 6 1) simpleGrading (1 1 1)//6
    hex (7 8 18 17 28 29 39 38) (6 165 1) simpleGrading (1 1 1)//7
    hex (8 12 19 18 29 33 40 39) (90 165 1) simpleGrading (1 1 1)//8
    hex (9 10 12 8 30 31 33 29) (90 36 1) simpleGrading (1 1 1)//9
   
);

edges
(
);

boundary
(
    inlet
    {
       type patch;
       faces
        (
            (0 11 32 21)
            (11 13 34 32)
        );
     }
    outlet
    {
       type patch;
       faces
        (
            (10 12 33 31)
            (12 19 40 33)
           
        );
     }
     bottom
    {
        type wall;
        faces
        (
            (0 1 22 21)
            (1 2 23 22)
            (2 3 24 23)
            (3 4 25 24)
            (4 5 26 25)
            (5 6 27 26)
            (6 7 28 27)
            (7 8 29 28)
            (8 9 30 29)   
            (9 10 31 30)
           
         
        );
     }
     atmosphere
    {
        type wall;
        faces
        (
            (13 14 35 34)
            (14 15 36 35)
            (15 16 37 36)
            (16 17 38 37)
            (17 18 39 38)
            (18 19 40 39)
        );

     }
);
mergePatchPairs
(
);

// ************************************************************************* //
