d7.8/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(   

   {
        name    forceFace1Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (0.1 1.58 -0.01) (0.3 1.652 1.01);
            
        }
    }
  {
        name    forceFace1;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace1Pri;
             option all;  
        }
  }
{
        name    forceFace1;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
   {
        name    forceFace2Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (0.3 1.58 -0.01) (0.5 1.652 1.01);
            
        }
    }
  {
        name    forceFace2;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace2Pri;
             option all;  
        }
  }
{
        name    forceFace2;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
   {
        name    forceFace3Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (0.5 1.58 -0.01) (0.7 1.652 1.01);
            
        }
    }
  {
        name    forceFace3;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace3Pri;
             option all;  
        }
  }
{
        name    forceFace3;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
   {
        name    forceFace4Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box   (0.7 1.58 -0.01) (0.9 1.652 1.01);
            
        }
    }
  {
        name    forceFace4;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace4Pri;
             option all;  
        }
  }
{
        name    forceFace4;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
   {
        name    forceFace5Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (0.9 1.58 -0.01) (1.1 1.652 1.01);
            
        }
    }
  {
        name    forceFace5;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace5Pri;
             option all;  
        }
  }
{
        name    forceFace5;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
   {
        name    forceFace6Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (1.1 1.58 -0.01) (1.3 1.652 1.01);
            
        }
    }
  {
        name    forceFace6;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace6Pri;
             option all;  
        }
  }
{
        name    forceFace6;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
   {
        name    forceFace7Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (1.3 1.58 -0.01) (1.5 1.652 1.01);
            
        }
    }
  {
        name    forceFace7;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace7Pri;
             option all;  
        }
  }
{
        name    forceFace7;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
   {
        name    forceFace8Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (1.5 1.58 -0.01) (1.7 1.652 1.01);
            
        }
    }
  {
        name    forceFace8;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace8Pri;
             option all;  
        }
  }
{
        name    forceFace8;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
   {
        name    forceFace9Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (1.7 1.58 -0.01) (1.9 1.652 1.01);
            
        }
    }
  {
        name    forceFace9;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace9Pri;
             option all;  
        }
  }
{
        name    forceFace9;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
 {
        name    forceFace10Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (1.9 1.58 -0.01) (2.1 1.652 1.01);
            
        }
    }
  {
        name    forceFace10;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace10Pri;
             option all;  
        }
  }
{
        name    forceFace10;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace11Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (2.1 1.58 -0.01) (2.3 1.652 1.01);
            
        }
    }
  {
        name    forceFace11;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace11Pri;
             option all;  
        }
  }
{
        name    forceFace11;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace12Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (2.3 1.58 -0.01) (2.5 1.652 1.01);
            
        }
    }
  {
        name    forceFace12;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace12Pri;
             option all;  
        }
  }
{
        name    forceFace12;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace13Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (2.5 1.58 -0.01) (2.7 1.652 1.01);
            
        }
    }
  {
        name    forceFace13;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace13Pri;
             option all;  
        }
  }
{
        name    forceFace13;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace14Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (2.7 1.58 -0.01) (2.9 1.652 1.01);
            
        }
    }
  {
        name    forceFace14;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace14Pri;
             option all;  
        }
  }
{
        name    forceFace14;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace15Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (2.9 1.58 -0.01) (3.1 1.652 1.01);
            
        }
    }
  {
        name    forceFace15;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace15Pri;
             option all;  
        }
  }
{
        name    forceFace15;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace16Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (3.1 1.58 -0.01) (3.3 1.652 1.01);
            
        }
    }
  {
        name    forceFace16;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace16Pri;
             option all;  
        }
  }
{
        name    forceFace16;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace17Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (3.3 1.58 -0.01) (3.5 1.652 1.01);
            
        }
    }
  {
        name    forceFace17;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace17Pri;
             option all;  
        }
  }
{
        name    forceFace17;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace18Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (3.5 1.58 -0.01) (3.7 1.652 1.01);
            
        }
    }
  {
        name    forceFace18;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace18Pri;
             option all;  
        }
  }
{
        name    forceFace18;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace19Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (3.7 1.58 -0.01) (3.9 1.652 1.01);
            
        }
    }
  {
        name    forceFace19;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace19Pri;
             option all;  
        }
  }
{
        name    forceFace19;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace20Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (3.9 1.58 -0.01) (4.1 1.652 1.01);
            
        }
    }
  {
        name    forceFace20;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace20Pri;
             option all;  
        }
  }
{
        name    forceFace20;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }


{
        name    forceFace21Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (4.1 1.58 -0.01) (4.3 1.652 1.01);
            
        }
    }
  {
        name    forceFace21;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace21Pri;
             option all;  
        }
  }
{
        name    forceFace21;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace22Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (4.3 1.58 -0.01) (4.5 1.652 1.01);
            
        }
    }
  {
        name    forceFace22;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace22Pri;
             option all;  
        }
  }
{
        name    forceFace22;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace23Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (4.5 1.58 -0.01) (4.7 1.652 1.01);
            
        }
    }
  {
        name    forceFace23;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace23Pri;
             option all;  
        }
  }
{
        name    forceFace23;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace24Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (4.7 1.58 -0.01) (4.9 1.652 1.01);
            
        }
    }
  {
        name    forceFace24;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace24Pri;
             option all;  
        }
  }
{
        name    forceFace24;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace25Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (4.9 1.58 -0.01) (5.1 1.652 1.01);
            
        }
    }
  {
        name    forceFace25;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace25Pri;
             option all;  
        }
  }
{
        name    forceFace25;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace26Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (5.1 1.58 -0.01) (5.3 1.652 1.01);
            
        }
    }
  {
        name    forceFace26;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace26Pri;
             option all;  
        }
  }
{
        name    forceFace26;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace27Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (5.3 1.58 -0.01) (5.5 1.652 1.01);
            
        }
    }
  {
        name    forceFace27;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace27Pri;
             option all;  
        }
  }
{
        name    forceFace27;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace28Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (5.5 1.58 -0.01) (5.7 1.652 1.01);
            
        }
    }
  {
        name    forceFace28;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace28Pri;
             option all;  
        }
  }
{
        name    forceFace28;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace29Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (5.7 1.58 -0.01) (5.9 1.652 1.01);
            
        }
    }
  {
        name    forceFace29;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace29Pri;
             option all;  
        }
  }
{
        name    forceFace29;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
{
        name    forceFace30Pri;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box  (5.9 1.58 -0.01) (6.1 1.652 1.01);
            
        }
    }
  {
        name    forceFace30;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
             set forceFace30Pri;
             option all;  
        }
  }
{
        name    forceFace30;
        type    faceSet;
        action  subset;
        source  patchToFace;
        sourceInfo
        {
            name bottom;
            
        }
    }
);
// *************************************************************************
